no_prefix: dict[str, str] = {
    "700": "生日贺卡",
    "701": "生日蛋糕",
    "702": "生日回礼",
    "703": "生日礼物",
}
comm: dict[str, str] = {
    "081": "进攻",
    "082": "等待",
    "083": "撤退",
    "084": "谢谢",
    "085": "称赞",
    "086": "是",
    "087": "否",
    "088": "抱歉",
    "089": "你好",
    # "090": "手榴弹",
    # "091": "拦截者",
    # "092": "烟雾弹",
    # "093": "闪光弹",
    # "094": "治疗雷",
    # "095": "风场雷",
    # "096": "减速雷",
    # "097": "警报器",
    "103": "这里可以安装炸弹",
    "105": "这里有子弹",
    "106": "这里有护甲",
    "107": "这里有战术道具",
    "151": "警报器发现敌人"
}


other: dict[str, str] = {
    "018": "获得角色",
    "021": "装备战术道具",
}


bp_char: dict[str, str] = {
    "019": "当天第一次进入休息室",  # 休息室是什么？

    # dorm
    "008": "早上问候",
    "009": "晚间问候",
    "010": "深夜问候",

    "001": "点击互动",
    "002": "点击互动",
    "003": "点击互动",
    "004": "摸头",

    "005": "收到邮件",

    "011": "玩家生日",
    "012": "角色生日",

    "006": "朋友生日",
    "007": "朋友生日",

    "013": "元旦",
    "014": "春节",
    "015": "圣诞节",
    "016": "情人节",
    "017": "卡拉彼丘纪念日",
    "065": "七夕",
    "023": "打招呼",
    "024": "赠送角色礼物",
    "025": "好感度上升后触碰",
    "026": "好感度上升后触碰",
    "027": "好感度上升后触碰",
    "028": "好感度上升后触碰",
    "029": "好感度上升后触碰",
    "030": "战斗胜利",
    "031": "战斗胜利MVP",
    "032": "战斗失败",
    "033": "战斗失败SVP",
    "034": "玩家生日",
    "035": "好感提升后交谈",
    "036": "好感提升后交谈",
    "037": "好感提升后交谈",
    "038": "好感提升后交谈",
    "039": "打招呼",
    "040": "打招呼",
    "041": "打招呼",
    "042": "打招呼",
    "043": "打招呼",
    "044": "自言自语",
    "045": "自言自语",
    "046": "自言自语",
    "047": "自言自语",
    "048": "自言自语",
    "049": "打断角色状态",
    "050": "打断角色状态",
    "051": "打断角色状态",
    "052": "打断角色状态",
    "053": "打断角色状态",
    "054": "近景交谈",
    "055": "近景交谈",
    "056": "感谢礼物",
    "057": "感谢专属礼物",
    "058": "近景交谈（进入房间后互动触发）",
    "059": "互动交谈",
    "060": "互动交谈",
    "061": "互动交谈",
    "062": "互动交谈",
    "063": "互动交谈",
    "064": "好感度10语音",

    # 战斗
    "066": "选择角色",
    # "067": "确认准备",
    # "068": "开场台词",
    # "069": "开场台词",
    # "070": "开场台词",
    # "137": "失败",
    # "138": "胜利",
    # "139": "失败SVP",
    # "140": "胜利MVP"
}
